In [42]:
import pandas as pd
from IPython.display import display
from sqlalchemy import create_engine

In [43]:
#lendo arquivo csv
df = pd.read_csv('relatorio.csv')
df.head()

   id cliente valor   produto  data_venda
0   1   Lucas   100  Notebook  2024/01/10
1   2     NaN   250     Mouse  2024/01/12
2   3   Carla   abc      Fone  2024/01/13
3   4    João   300       NaN  2024/01/15
4   5     Ana   150   Teclado  2024/01/18

In [44]:
# 2. **Transformação**

#    - Remova linhas com valores nulos em campos essenciais (`cliente`, `produto`, `valor`).


#    - Converta a coluna `valor` para numérico, tratando erros.
df['valor'] = pd.to_numeric(df['valor'], errors='coerce')
df_not_null = df.dropna()
display(df_not_null)

   id cliente  valor   produto  data_venda
0   1   Lucas  100.0  Notebook  2024/01/10
4   5     Ana  150.0   Teclado  2024/01/18

In [45]:
# 3. Cria nova coluna com imposto de 12%
df_not_null.loc[:, 'imposto'] = df_not_null['valor'] * 1.12
display(df_not_null)

C:\Users\Gioher\AppData\Local\Temp\ipykernel_9656\1770645025.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_not_null.loc[:, 'imposto'] = df_not_null['valor'] * 1.12

   id cliente  valor   produto  data_venda  imposto
0   1   Lucas  100.0  Notebook  2024/01/10    112.0
4   5     Ana  150.0   Teclado  2024/01/18    168.0

In [46]:
#Carga

#Salve o resultado em um novo arquivo vendas_processadas.csv ou carregue os dados em um banco SQLite.

df_not_null.to_csv('relatorio_limpo.csv', sep=',')

In [47]:
user = 'postgres'
password = 'postgres'
host = 'localhost'
port = '5432'
banco = 'pipeline01'

engine = create_engine(f'postgresql+psycopg2://{user}:{password}@{host}:{port}/{banco}')
tabela = 'relatorio_limpo'

#enviando ao banco de dados
df_not_null.to_sql(tabela, engine, if_exists='replace', index=False)
print("Dados inseridos com sucesso!")

Dados inseridos com sucesso!